In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
%matplotlib inline

In [2]:
data = pd.read_csv('aug_train.csv')

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19158 entries, 0 to 19157
Data columns (total 14 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   enrollee_id             19158 non-null  int64
 1   city                    19158 non-null  object
 2   city_development_index  19158 non-null  float64
 3   gender                  14650 non-null  object
 4   relevent_experience     19158 non-null  object
 5   enrolled_university     18772 non-null  object
 6   education_level         18698 non-null  object
 7   major_discipline        16345 non-null  object
 8   experience              19093 non-null  object
 9   company_size            13220 non-null  object
 10  company_type            13018 non-null  object
 11  last_new_job            18735 non-null  object
 12  training_hours          19158 non-null  int64
 13  target                  19158 non-null  float64
dtypes: float64(2), int64(2), object(10)
memory usage: 2.0+ MB

In [4]:
data.dropna(inplace=True)

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8955 entries, 1 to 19155
Data columns (total 14 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   enrollee_id             8955 non-null   int64
 1   city                    8955 non-null   object
 2   city_development_index  8955 non-null   float64
 3   gender                  8955 non-null   object
 4   relevent_experience     8955 non-null   object
 5   enrolled_university     8955 non-null   object
 6   education_level         8955 non-null   object
 7   major_discipline        8955 non-null   object
 8   experience              8955 non-null   object
 9   company_size            8955 non-null   object
 10  company_type            8955 non-null   object
 11  last_new_job            8955 non-null   object
 12  training_hours          8955 non-null   int64
 13  target                  8955 non-null   float64
dtypes: float64(2), int64(2), object(10)
memory usage: 1.0+ MB

In [6]:
data.head()

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0
7,402,city_46,0.762,Male,Has relevent experience,no_enrollment,Graduate,STEM,13,<10,Pvt Ltd,>4,18,1.0
8,27107,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,7,50-99,Pvt Ltd,1,46,1.0
11,23853,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,5,5000-9999,Pvt Ltd,1,108,0.0

In [7]:
data.drop('enrollee_id', 1, inplace=True)

In [8]:
data.head()

,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
1,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
4,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0
7,city_46,0.762,Male,Has relevent experience,no_enrollment,Graduate,STEM,13,<10,Pvt Ltd,>4,18,1.0
8,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,7,50-99,Pvt Ltd,1,46,1.0
11,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,5,5000-9999,Pvt Ltd,1,108,0.0

In [9]:
data.shape

(8955, 13)

In [10]:
data['city'].unique()

array(['city_40', 'city_162', 'city_46', 'city_103', 'city_61',
       'city_114', 'city_159', 'city_21', 'city_160', 'city_16',
       'city_83', 'city_64', 'city_105', 'city_104', 'city_73', 'city_75',
       'city_100', 'city_93', 'city_67', 'city_13', 'city_36', 'city_71',
       'city_57', 'city_65', 'city_11', 'city_136', 'city_97', 'city_50',
       'city_173', 'city_82', 'city_89', 'city_150', 'city_90', 'city_98',
       'city_28', 'city_115', 'city_94', 'city_165', 'city_142',
       'city_12', 'city_43', 'city_74', 'city_102', 'city_116', 'city_99',
       'city_23', 'city_138', 'city_45', 'city_41', 'city_72', 'city_19',
       'city_101', 'city_20', 'city_106', 'city_10', 'city_157',
       'city_144', 'city_91', 'city_133', 'city_145', 'city_123',
       'city_175', 'city_128', 'city_167', 'city_84', 'city_54',
       'city_126', 'city_81', 'city_176', 'city_131', 'city_149',
       'city_24', 'city_27', 'city_118', 'city_152', 'city_141',
       'city_76', 'city_70', 'city_143', 'city_78', 'city_53', 'city_158',
       'city_2', 'city_77', 'city_117', 'city_120', 'city_9', 'city_39',
       'city_80', 'city_155', 'city_179', 'city_37', 'city_30', 'city_44',
       'city_14', 'city_55', 'city_42', 'city_1', 'city_59', 'city_69',
       'city_7', 'city_109', 'city_26', 'city_62', 'city_18', 'city_127',
       'city_33', 'city_134', 'city_146', 'city_107', 'city_166',
       'city_121', 'city_129', 'city_48', 'city_139', 'city_25'],
      dtype=object)

In [11]:
data.drop('city', 1, inplace=True)

In [12]:
data.shape

(8955, 12)

In [13]:
data.head()

,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
1,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
4,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0
7,0.762,Male,Has relevent experience,no_enrollment,Graduate,STEM,13,<10,Pvt Ltd,>4,18,1.0
8,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,7,50-99,Pvt Ltd,1,46,1.0
11,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,5,5000-9999,Pvt Ltd,1,108,0.0

In [14]:
data['gender'].nunique()

3

In [15]:
data['relevent_experience'].nunique()

2

In [16]:
data['enrolled_university'].nunique()

3

In [17]:
data['education_level'].nunique()

3

In [18]:
data['major_discipline'].nunique()

6

In [19]:
data['experience'].value_counts()

>20    1881
5       575
10      551
6       535
9       533
7       485
4       480
3       428
15      398
8       398
11      372
14      333
16      304
2       297
12      293
13      235
17      206
19      179
18      168
1       121
<1       97
20       86
Name: experience, dtype: int64

In [20]:
data['experience'].map(type).value_counts()

<class 'str'>    8955
Name: experience, dtype: int64

In [21]:
data['company_size'].value_counts()

50-99        1986
100-500      1814
10000+       1449
10/49         951
1000-4999     930
<10           840
500-999       592
5000-9999     393
Name: company_size, dtype: int64

In [22]:
data['company_size'].map(type).value_counts()

<class 'str'>    8955
Name: company_size, dtype: int64

In [23]:
data['company_type'].value_counts()

Pvt Ltd                6794
Funded Startup          784
Public Sector           564
Early Stage Startup     385
NGO                     356
Other                    72
Name: company_type, dtype: int64

In [24]:
data['last_new_job'].unique()

array(['>4', '4', '1', '3', '2', 'never'], dtype=object)

In [25]:
data['training_hours']

1         47
4          8
7         18
8         46
11       108
        ...
19147     52
19149     36
19150     23
19152     25
19155     44
Name: training_hours, Length: 8955, dtype: int64

In [26]:
data['training_hours'].map(type).value_counts()

<class 'int'>    8955
Name: training_hours, dtype: int64

In [27]:
data.shape

(8955, 12)

In [28]:
df = pd.get_dummies(data, columns=["gender", 'enrolled_university', 'education_level', 'major_discipline', 'company_size', 'company_type', 'last_new_job'])

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8955 entries, 1 to 19155
Data columns (total 40 columns):
 #   Column                                Non-Null Count  Dtype
---  ------                                --------------  -----
 0   city_development_index                8955 non-null   float64
 1   relevent_experience                   8955 non-null   object
 2   experience                            8955 non-null   object
 3   training_hours                        8955 non-null   int64
 4   target                                8955 non-null   float64
 5   gender_Female                         8955 non-null   uint8
 6   gender_Male                           8955 non-null   uint8
 7   gender_Other                          8955 non-null   uint8
 8   enrolled_university_Full time course  8955 non-null   uint8
 9   enrolled_university_Part time course  8955 non-null   uint8
 10  enrolled_university_no_enrollment     8955 non-null   uint8
 11  education_level_Graduate              8955 non-null   uint8
 12  education_level_Masters               8955 non-null   uint8
 13  education_level_Phd                   8955 non-null   uint8
 14  major_discipline_Arts                 8955 non-null   uint8
 15  major_discipline_Business Degree      8955 non-null   uint8
 16  major_discipline_Humanities           8955 non-null   uint8
 17  major_discipline_No Major             8955 non-null   uint8
 18  major_discipline_Other                8955 non-null   uint8
 19  major_discipline_STEM                 8955 non-null   uint8
 20  company_size_10/49                    8955 non-null   uint8
 21  company_size_100-500                  8955 non-null   uint8
 22  company_size_1000-4999                8955 non-null   uint8
 23  company_size_10000+                   8955 non-null   uint8
 24  company_size_50-99                    8955 non-null   uint8
 25  company_size_500-999                  8955 non-null   uint8
 26  company_size_5000-9999                8955 non-null   uint8
 27  company_size_<10                      8955 non-null   uint8
 28  company_type_Early Stage Startup      8955 non-null   uint8
 29  company_type_Funded Startup           8955 non-null   uint8
 30  company_type_NGO                      8955 non-null   uint8
 31  company_type_Other                    8955 non-null   uint8
 32  company_type_Public Sector            8955 non-null   uint8
 33  company_type_Pvt Ltd                  8955 non-null   uint8
 34  last_new_job_1                        8955 non-null   uint8
 35  last_new_job_2                        8955 non-null   uint8
 36  last_new_job_3                        8955 non-null   uint8
 37  last_new_job_4                        8955 non-null   uint8
 38  last_new_job_>4                       8955 non-null   uint8
 39  last_new_job_never                    8955 non-null   uint8
dtypes: float64(2), int64(1), object(2), uint8(35)
memory usage: 725.8+ KB

In [30]:
data['training_hours']

1         47
4          8
7         18
8         46
11       108
        ...
19147     52
19149     36
19150     23
19152     25
19155     44
Name: training_hours, Length: 8955, dtype: int64

In [31]:
data['training_hours'].nunique()

241

In [32]:
df.head()

,city_development_index,relevent_experience,experience,training_hours,target,gender_Female,gender_Male,gender_Other,enrolled_university_Full time course,enrolled_university_Part time course,...,company_type_NGO,company_type_Other,company_type_Public Sector,company_type_Pvt Ltd,last_new_job_1,last_new_job_2,last_new_job_3,last_new_job_4,last_new_job_>4,last_new_job_never
1,0.776,No relevent experience,15,47,0.0,0,1,0,0,0,...,0,0,0,1,0,0,0,0,1,0
4,0.767,Has relevent experience,>20,8,0.0,0,1,0,0,0,...,0,0,0,0,0,0,0,1,0,0
7,0.762,Has relevent experience,13,18,1.0,0,1,0,0,0,...,0,0,0,1,0,0,0,0,1,0
8,0.920,Has relevent experience,7,46,1.0,0,1,0,0,0,...,0,0,0,1,1,0,0,0,0,0
11,0.920,Has relevent experience,5,108,0.0,0,1,0,0,0,...,0,0,0,1,1,0,0,0,0,0

In [33]:
df['relevent_experience'] = df['relevent_experience'].astype('category')

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8955 entries, 1 to 19155
Data columns (total 40 columns):
 #   Column                                Non-Null Count  Dtype
---  ------                                --------------  -----
 0   city_development_index                8955 non-null   float64
 1   relevent_experience                   8955 non-null   category
 2   experience                            8955 non-null   object
 3   training_hours                        8955 non-null   int64
 4   target                                8955 non-null   float64
 5   gender_Female                         8955 non-null   uint8
 6   gender_Male                           8955 non-null   uint8
 7   gender_Other                          8955 non-null   uint8
 8   enrolled_university_Full time course  8955 non-null   uint8
 9   enrolled_university_Part time course  8955 non-null   uint8
 10  enrolled_university_no_enrollment     8955 non-null   uint8
 11  education_level_Graduate              8955 non-null   uint8
 12  education_level_Masters               8955 non-null   uint8
 13  education_level_Phd                   8955 non-null   uint8
 14  major_discipline_Arts                 8955 non-null   uint8
 15  major_discipline_Business Degree      8955 non-null   uint8
 16  major_discipline_Humanities           8955 non-null   uint8
 17  major_discipline_No Major             8955 non-null   uint8
 18  major_discipline_Other                8955 non-null   uint8
 19  major_discipline_STEM                 8955 non-null   uint8
 20  company_size_10/49                    8955 non-null   uint8
 21  company_size_100-500                  8955 non-null   uint8
 22  company_size_1000-4999                8955 non-null   uint8
 23  company_size_10000+                   8955 non-null   uint8
 24  company_size_50-99                    8955 non-null   uint8
 25  company_size_500-999                  8955 non-null   uint8
 26  company_size_5000-9999                8955 non-null   uint8
 27  company_size_<10                      8955 non-null   uint8
 28  company_type_Early Stage Startup      8955 non-null   uint8
 29  company_type_Funded Startup           8955 non-null   uint8
 30  company_type_NGO                      8955 non-null   uint8
 31  company_type_Other                    8955 non-null   uint8
 32  company_type_Public Sector            8955 non-null   uint8
 33  company_type_Pvt Ltd                  8955 non-null   uint8
 34  last_new_job_1                        8955 non-null   uint8
 35  last_new_job_2                        8955 non-null   uint8
 36  last_new_job_3                        8955 non-null   uint8
 37  last_new_job_4                        8955 non-null   uint8
 38  last_new_job_>4                       8955 non-null   uint8
 39  last_new_job_never                    8955 non-null   uint8
dtypes: category(1), float64(2), int64(1), object(1), uint8(35)
memory usage: 664.7+ KB

In [35]:
df['relevent_experience'] = df['relevent_experience'].cat.codes

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8955 entries, 1 to 19155
Data columns (total 40 columns):
 #   Column                                Non-Null Count  Dtype
---  ------                                --------------  -----
 0   city_development_index                8955 non-null   float64
 1   relevent_experience                   8955 non-null   int8
 2   experience                            8955 non-null   object
 3   training_hours                        8955 non-null   int64
 4   target                                8955 non-null   float64
 5   gender_Female                         8955 non-null   uint8
 6   gender_Male                           8955 non-null   uint8
 7   gender_Other                          8955 non-null   uint8
 8   enrolled_university_Full time course  8955 non-null   uint8
 9   enrolled_university_Part time course  8955 non-null   uint8
 10  enrolled_university_no_enrollment     8955 non-null   uint8
 11  education_level_Graduate              8955 non-null   uint8
 12  education_level_Masters               8955 non-null   uint8
 13  education_level_Phd                   8955 non-null   uint8
 14  major_discipline_Arts                 8955 non-null   uint8
 15  major_discipline_Business Degree      8955 non-null   uint8
 16  major_discipline_Humanities           8955 non-null   uint8
 17  major_discipline_No Major             8955 non-null   uint8
 18  major_discipline_Other                8955 non-null   uint8
 19  major_discipline_STEM                 8955 non-null   uint8
 20  company_size_10/49                    8955 non-null   uint8
 21  company_size_100-500                  8955 non-null   uint8
 22  company_size_1000-4999                8955 non-null   uint8
 23  company_size_10000+                   8955 non-null   uint8
 24  company_size_50-99                    8955 non-null   uint8
 25  company_size_500-999                  8955 non-null   uint8
 26  company_size_5000-9999                8955 non-null   uint8
 27  company_size_<10                      8955 non-null   uint8
 28  company_type_Early Stage Startup      8955 non-null   uint8
 29  company_type_Funded Startup           8955 non-null   uint8
 30  company_type_NGO                      8955 non-null   uint8
 31  company_type_Other                    8955 non-null   uint8
 32  company_type_Public Sector            8955 non-null   uint8
 33  company_type_Pvt Ltd                  8955 non-null   uint8
 34  last_new_job_1                        8955 non-null   uint8
 35  last_new_job_2                        8955 non-null   uint8
 36  last_new_job_3                        8955 non-null   uint8
 37  last_new_job_4                        8955 non-null   uint8
 38  last_new_job_>4                       8955 non-null   uint8
 39  last_new_job_never                    8955 non-null   uint8
dtypes: float64(2), int64(1), int8(1), object(1), uint8(35)
memory usage: 664.6+ KB

In [37]:
df.head()

,city_development_index,relevent_experience,experience,training_hours,target,gender_Female,gender_Male,gender_Other,enrolled_university_Full time course,enrolled_university_Part time course,...,company_type_NGO,company_type_Other,company_type_Public Sector,company_type_Pvt Ltd,last_new_job_1,last_new_job_2,last_new_job_3,last_new_job_4,last_new_job_>4,last_new_job_never
1,0.776,1,15,47,0.0,0,1,0,0,0,...,0,0,0,1,0,0,0,0,1,0
4,0.767,0,>20,8,0.0,0,1,0,0,0,...,0,0,0,0,0,0,0,1,0,0
7,0.762,0,13,18,1.0,0,1,0,0,0,...,0,0,0,1,0,0,0,0,1,0
8,0.920,0,7,46,1.0,0,1,0,0,0,...,0,0,0,1,1,0,0,0,0,0
11,0.920,0,5,108,0.0,0,1,0,0,0,...,0,0,0,1,1,0,0,0,0,0

In [48]:
from random import randint
def fix_experience(x):
    if x == '>20':
        return randint(20,26)
    elif x == '<1':
        return 0
    return int(x)

In [49]:
df['experience'] = df['experience'].apply(fix_experience)

In [50]:
df.head()

,city_development_index,relevent_experience,experience,training_hours,target,gender_Female,gender_Male,gender_Other,enrolled_university_Full time course,enrolled_university_Part time course,...,company_type_NGO,company_type_Other,company_type_Public Sector,company_type_Pvt Ltd,last_new_job_1,last_new_job_2,last_new_job_3,last_new_job_4,last_new_job_>4,last_new_job_never
1,0.776,1,15,47,0.0,0,1,0,0,0,...,0,0,0,1,0,0,0,0,1,0
4,0.767,0,20,8,0.0,0,1,0,0,0,...,0,0,0,0,0,0,0,1,0,0
7,0.762,0,13,18,1.0,0,1,0,0,0,...,0,0,0,1,0,0,0,0,1,0
8,0.920,0,7,46,1.0,0,1,0,0,0,...,0,0,0,1,1,0,0,0,0,0
11,0.920,0,5,108,0.0,0,1,0,0,0,...,0,0,0,1,1,0,0,0,0,0

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8955 entries, 1 to 19155
Data columns (total 40 columns):
 #   Column                                Non-Null Count  Dtype
---  ------                                --------------  -----
 0   city_development_index                8955 non-null   float64
 1   relevent_experience                   8955 non-null   int8
 2   experience                            8955 non-null   int64
 3   training_hours                        8955 non-null   int64
 4   target                                8955 non-null   float64
 5   gender_Female                         8955 non-null   uint8
 6   gender_Male                           8955 non-null   uint8
 7   gender_Other                          8955 non-null   uint8
 8   enrolled_university_Full time course  8955 non-null   uint8
 9   enrolled_university_Part time course  8955 non-null   uint8
 10  enrolled_university_no_enrollment     8955 non-null   uint8
 11  education_level_Graduate              8955 non-null   uint8
 12  education_level_Masters               8955 non-null   uint8
 13  education_level_Phd                   8955 non-null   uint8
 14  major_discipline_Arts                 8955 non-null   uint8
 15  major_discipline_Business Degree      8955 non-null   uint8
 16  major_discipline_Humanities           8955 non-null   uint8
 17  major_discipline_No Major             8955 non-null   uint8
 18  major_discipline_Other                8955 non-null   uint8
 19  major_discipline_STEM                 8955 non-null   uint8
 20  company_size_10/49                    8955 non-null   uint8
 21  company_size_100-500                  8955 non-null   uint8
 22  company_size_1000-4999                8955 non-null   uint8
 23  company_size_10000+                   8955 non-null   uint8
 24  company_size_50-99                    8955 non-null   uint8
 25  company_size_500-999                  8955 non-null   uint8
 26  company_size_5000-9999                8955 non-null   uint8
 27  company_size_<10                      8955 non-null   uint8
 28  company_type_Early Stage Startup      8955 non-null   uint8
 29  company_type_Funded Startup           8955 non-null   uint8
 30  company_type_NGO                      8955 non-null   uint8
 31  company_type_Other                    8955 non-null   uint8
 32  company_type_Public Sector            8955 non-null   uint8
 33  company_type_Pvt Ltd                  8955 non-null   uint8
 34  last_new_job_1                        8955 non-null   uint8
 35  last_new_job_2                        8955 non-null   uint8
 36  last_new_job_3                        8955 non-null   uint8
 37  last_new_job_4                        8955 non-null   uint8
 38  last_new_job_>4                       8955 non-null   uint8
 39  last_new_job_never                    8955 non-null   uint8
dtypes: float64(2), int64(2), int8(1), uint8(35)
memory usage: 664.6 KB

In [52]:
df['experience'].value_counts()

5     575
10    551
6     535
9     533
7     485
4     480
3     428
8     398
15    398
11    372
20    364
14    333
16    304
2     297
12    293
22    284
24    275
25    272
21    263
26    261
23    248
13    235
17    206
19    179
18    168
1     121
0      97
Name: experience, dtype: int64

In [53]:
X = df.drop('target', 1)

In [54]:
y = df['target']

In [56]:
from sklearn.model_selection import train_test_split

In [57]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.33, random_state=42)

In [76]:
from sklearn.ensemble import RandomForestClassifier
rfc = RandomForestClassifier(n_estimators = 1000).fit(X_train, y_train)
rfc.score(X_test, y_test)

0.8481055480378891

In [68]:
from sklearn.preprocessing import StandardScaler

In [69]:
scaler = StandardScaler().fit(X) # sukuriame StandardScaler objektÄ…
scaled_features = scaler.transform(X) # perdarome reikÅ¡mes Ä¯ KNN klasifikatoriui priimtinesnÄ¯ formatÄ…

In [70]:
features = pd.DataFrame(scaled_features, columns=X.columns)

In [71]:
X_train, X_test, y_train, y_test = train_test_split(features, y, test_size=0.33, random_state=42)

In [73]:
from sklearn.ensemble import RandomForestClassifier
rfc = RandomForestClassifier(n_estimators = 1000).fit(X_train, y_train)
rfc.score(X_test, y_test)

0.8487821380243572

In [75]:
from sklearn.neighbors import KNeighborsClassifier
knc = KNeighborsClassifier(n_neighbors = 11).fit(X_train, y_train)
knc.score(X_test, y_test)

0.8376184032476319